{
  "format": "graph-model",
  "generatedBy": "2.14.0",
  "convertedBy": "TensorFlow.js Converter v4.14.0",
  "signature": {
    "inputs": {
      "images": {
        "name": "images:0",
        "dtype": "DT_FLOAT",
        "tensorShape": { "dim": [{ "size": "1" }, { "size": "3" }, { "size": "512" }, { "size": "512" }] }
      }
    },
    "outputs": {
      "output0": {
        "name": "Identity:0",
        "dtype": "DT_FLOAT",
        "tensorShape": { "dim": [{ "size": "1" }, { "size": "15" }, { "size": "5376" }] }
      }
    }
  },
  "modelTopology": {
    "node": [
      {
        "name": "ConstantFolding/PartitionedCall/onnx_tf_prefix_/model.22/Div_1_recip",
        "op": "Const",
        "attr": { "dtype": { "type": "DT_FLOAT" }, "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": {} } } }
      },
      {
        "name": "PartitionedCall/SelectV2_77",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": { "dim": [{ "size": "1" }] } } },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/zeros_24",
        "op": "Const",
        "attr": { "dtype": { "type": "DT_INT64" }, "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": {} } } }
      },
      {
        "name": "PartitionedCall/Const_107",
        "op": "Const",
        "attr": { "dtype": { "type": "DT_INT64" }, "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": {} } } }
      },
      {
        "name": "PartitionedCall/Shape_29",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": { "dim": [{ "size": "3" }] } } },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/ExpandDims_19",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": { "dim": [{ "size": "1" }, { "size": "1" }] } } }
        }
      },
      {
        "name": "PartitionedCall/Cast_48",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": { "dim": [{ "size": "1" }] } } },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/SelectV2_78",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": { "dim": [{ "size": "1" }] } } },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/Const_106",
        "op": "Const",
        "attr": { "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": {} } }, "dtype": { "type": "DT_INT64" } }
      },
      {
        "name": "PartitionedCall/ones_17",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": { "dim": [{ "size": "3" }] } } }
        }
      },
      {
        "name": "unknown_182",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "1" }, { "size": "2" }, { "size": "5376" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "PartitionedCall/SelectV2_65",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": { "dim": [{ "size": "1" }] } } },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/zeros_19",
        "op": "Const",
        "attr": { "dtype": { "type": "DT_INT64" }, "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": {} } } }
      },
      {
        "name": "PartitionedCall/Const_97",
        "op": "Const",
        "attr": { "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": {} } }, "dtype": { "type": "DT_INT64" } }
      },
      {
        "name": "PartitionedCall/Shape_22",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": { "dim": [{ "size": "3" }] } } }
        }
      },
      {
        "name": "PartitionedCall/SelectV2_66",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": { "dim": [{ "size": "1" }] } } },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/Const_96",
        "op": "Const",
        "attr": { "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": {} } }, "dtype": { "type": "DT_INT64" } }
      },
      {
        "name": "PartitionedCall/ExpandDims_16",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": { "dim": [{ "size": "1" }, { "size": "1" }] } } }
        }
      },
      {
        "name": "PartitionedCall/Cast_40",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": { "dim": [{ "size": "1" }] } } }
        }
      },
      {
        "name": "PartitionedCall/Const_98",
        "op": "Const",
        "attr": { "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": {} } }, "dtype": { "type": "DT_INT64" } }
      },
      {
        "name": "unknown_177",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": { "dim": [{ "size": "4" }] } } },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/Where_3",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": { "dim": [{}, { "size": "1" }] } } }
        }
      },
      {
        "name": "PartitionedCall/Cast_43",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": { "dim": [{ "size": "1" }] } } }
        }
      },
      {
        "name": "PartitionedCall/GatherV2_3",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": { "dim": [{}] } } },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/zeros_21",
        "op": "Const",
        "attr": { "dtype": { "type": "DT_INT64" }, "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": {} } } }
      },
      {
        "name": "PartitionedCall/onnx_tf_prefix_/model.22/dfl/Transpose/perm",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": { "dim": [{ "size": "4" }] } } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/concat_83",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": { "dim": [{ "size": "4" }] } } }
        }
      },
      {
        "name": "PartitionedCall/concat_84",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": { "dim": [{ "size": "4" }] } } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/transpose_261/perm",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": { "dim": [{ "size": "4" }] } } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/split_83",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "1" }, { "size": "1" }, { "size": "16" }, { "size": "1" }] }
            }
          }
        }
      },
      {
        "name": "PartitionedCall/transpose_262/perm",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": { "dim": [{ "size": "4" }] } } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "unknown_179",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": { "dim": [{ "size": "3" }] } } }
        }
      },
      {
        "name": "PartitionedCall/Where_4",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": { "dim": [{}, { "size": "1" }] } } }
        }
      },
      {
        "name": "PartitionedCall/Cast_44",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": { "dim": [{ "size": "1" }] } } }
        }
      },
      {
        "name": "PartitionedCall/GatherV2_4",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": { "dim": [{}] } } }
        }
      },
      {
        "name": "PartitionedCall/zeros_22",
        "op": "Const",
        "attr": { "dtype": { "type": "DT_INT64" }, "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": {} } } }
      },
      {
        "name": "PartitionedCall/SelectV2_73",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": { "dim": [{ "size": "1" }] } } }
        }
      },
      {
        "name": "PartitionedCall/zeros_23",
        "op": "Const",
        "attr": { "dtype": { "type": "DT_INT64" }, "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": {} } } }
      },
      {
        "name": "PartitionedCall/Const_105",
        "op": "Const",
        "attr": { "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": {} } }, "dtype": { "type": "DT_INT64" } }
      },
      {
        "name": "PartitionedCall/Shape_28",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": { "dim": [{ "size": "3" }] } } }
        }
      },
      {
        "name": "PartitionedCall/ExpandDims_18",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": { "dim": [{ "size": "1" }, { "size": "1" }] } } },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/Cast_46",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": { "dim": [{ "size": "1" }] } } }
        }
      },
      {
        "name": "PartitionedCall/SelectV2_74",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": { "dim": [{ "size": "1" }] } } }
        }
      },
      {
        "name": "PartitionedCall/Const_104",
        "op": "Const",
        "attr": { "dtype": { "type": "DT_INT64" }, "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": {} } } }
      },
      {
        "name": "PartitionedCall/ones_16",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": { "dim": [{ "size": "3" }] } } },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/onnx_tf_prefix_/model.22/Concat_4/axis",
        "op": "Const",
        "attr": { "dtype": { "type": "DT_INT32" }, "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } } }
      },
      {
        "name": "unknown_184",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": { "dtype": "DT_FLOAT", "tensorShape": { "dim": [{ "size": "1" }, { "size": "5376" }] } }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "PartitionedCall/Const_64",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": { "dim": [{ "size": "4" }, { "size": "2" }] } } }
        }
      },
      {
        "name": "PartitionedCall/transpose_167/perm",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": { "dim": [{ "size": "4" }] } } }
        }
      },
      {
        "name": "PartitionedCall/split_52",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "3" }, { "size": "3" }, { "size": "192" }, { "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "unknown_113",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": { "dim": [{ "size": "64" }] } } },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "PartitionedCall/transpose_168/perm",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": { "dim": [{ "size": "4" }] } } }
        }
      },
      {
        "name": "PartitionedCall/Const_66",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": { "dim": [{ "size": "4" }, { "size": "2" }] } } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/transpose_173/perm",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": { "dim": [{ "size": "4" }] } } }
        }
      },
      {
        "name": "PartitionedCall/split_54",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "3" }, { "size": "3" }, { "size": "64" }, { "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "unknown_117",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": { "dim": [{ "size": "64" }] } } },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "PartitionedCall/transpose_174/perm",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": { "dim": [{ "size": "4" }] } } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/transpose_182/perm",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": { "dim": [{ "size": "4" }] } } }
        }
      },
      {
        "name": "PartitionedCall/split_57",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "1" }, { "size": "1" }, { "size": "64" }, { "size": "64" }] }
            }
          }
        }
      },
      {
        "name": "unknown_123",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": { "dim": [{ "size": "64" }] } } },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "PartitionedCall/transpose_183/perm",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": { "dim": [{ "size": "4" }] } } }
        }
      },
      {
        "name": "PartitionedCall/Const_65",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": { "dim": [{ "size": "4" }, { "size": "2" }] } } }
        }
      },
      {
        "name": "PartitionedCall/transpose_170/perm",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": { "dim": [{ "size": "4" }] } } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/split_53",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "3" }, { "size": "3" }, { "size": "192" }, { "size": "192" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "unknown_115",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": { "dim": [{ "size": "192" }] } } }
        }
      },
      {
        "name": "PartitionedCall/transpose_171/perm",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": { "dim": [{ "size": "4" }] } } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/Const_67",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": { "dim": [{ "size": "4" }, { "size": "2" }] } } }
        }
      },
      {
        "name": "PartitionedCall/transpose_176/perm",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": { "dim": [{ "size": "4" }] } } }
        }
      },
      {
        "name": "PartitionedCall/split_55",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "3" }, { "size": "3" }, { "size": "192" }, { "size": "192" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "unknown_119",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": { "dim": [{ "size": "192" }] } } },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "PartitionedCall/transpose_177/perm",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": { "dim": [{ "size": "4" }] } } }
        }
      },
      {
        "name": "PartitionedCall/transpose_185/perm",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": { "dim": [{ "size": "4" }] } } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/split_58",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "1" }, { "size": "1" }, { "size": "192" }, { "size": "11" }] }
            }
          }
        }
      },
      {
        "name": "unknown_125",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": { "dim": [{ "size": "11" }] } } }
        }
      },
      {
        "name": "PartitionedCall/transpose_186/perm",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": { "dim": [{ "size": "4" }] } } }
        }
      },
      {
        "name": "PartitionedCall/onnx_tf_prefix_/model.22/Concat/axis",
        "op": "Const",
        "attr": { "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } }, "dtype": { "type": "DT_INT32" } }
      },
      {
        "name": "PartitionedCall/Where",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": { "dim": [{}, { "size": "1" }] } } },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/Cast_32",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": { "dim": [{ "size": "1" }] } } }
        }
      },
      {
        "name": "PartitionedCall/GatherV2",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": { "dim": [{}] } } }
        }
      },
      {
        "name": "PartitionedCall/zeros_14",
        "op": "Const",
        "attr": { "dtype": { "type": "DT_INT64" }, "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": {} } } }
      },
      {
        "name": "PartitionedCall/Const_78",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": { "dim": [{ "size": "4" }, { "size": "2" }] } } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/transpose_206/perm",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": { "dim": [{ "size": "4" }] } } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/split_65",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "3" }, { "size": "3" }, { "size": "384" }, { "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "unknown_140",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": { "dim": [{ "size": "64" }] } } },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "PartitionedCall/transpose_207/perm",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": { "dim": [{ "size": "4" }] } } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/Const_80",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": { "dim": [{ "size": "4" }, { "size": "2" }] } } }
        }
      },
      {
        "name": "PartitionedCall/transpose_212/perm",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": { "dim": [{ "size": "4" }] } } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/split_67",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "3" }, { "size": "3" }, { "size": "64" }, { "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "unknown_144",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": { "dim": [{ "size": "64" }] } } },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "PartitionedCall/transpose_213/perm",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": { "dim": [{ "size": "4" }] } } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/transpose_221/perm",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": { "dim": [{ "size": "4" }] } } }
        }
      },
      {
        "name": "PartitionedCall/split_70",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "1" }, { "size": "1" }, { "size": "64" }, { "size": "64" }] }
            }
          }
        }
      },
      {
        "name": "unknown_150",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": { "dim": [{ "size": "64" }] } } }
        }
      },
      {
        "name": "PartitionedCall/transpose_222/perm",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": { "dim": [{ "size": "4" }] } } }
        }
      },
      {
        "name": "PartitionedCall/Const_79",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": { "dim": [{ "size": "4" }, { "size": "2" }] } } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/transpose_209/perm",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": { "dim": [{ "size": "4" }] } } }
        }
      },
      {
        "name": "PartitionedCall/split_66",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "3" }, { "size": "3" }, { "size": "384" }, { "size": "192" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "unknown_142",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": { "dim": [{ "size": "192" }] } } },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "PartitionedCall/transpose_210/perm",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": { "dim": [{ "size": "4" }] } } }
        }
      },
      {
        "name": "PartitionedCall/Const_81",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": { "dim": [{ "size": "4" }, { "size": "2" }] } } }
        }
      },
      {
        "name": "PartitionedCall/transpose_215/perm",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": { "dim": [{ "size": "4" }] } } }
        }
      },
      {
        "name": "PartitionedCall/split_68",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "3" }, { "size": "3" }, { "size": "192" }, { "size": "192" }] }
            }
          }
        }
      },
      {
        "name": "unknown_146",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": { "dim": [{ "size": "192" }] } } },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "PartitionedCall/transpose_216/perm",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": { "dim": [{ "size": "4" }] } } }
        }
      },
      {
        "name": "PartitionedCall/transpose_224/perm",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": { "dim": [{ "size": "4" }] } } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/split_71",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "1" }, { "size": "1" }, { "size": "192" }, { "size": "11" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "unknown_152",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": { "dim": [{ "size": "11" }] } } }
        }
      },
      {
        "name": "PartitionedCall/transpose_225/perm",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": { "dim": [{ "size": "4" }] } } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/onnx_tf_prefix_/model.22/Concat_1/axis",
        "op": "Const",
        "attr": { "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } }, "dtype": { "type": "DT_INT32" } }
      },
      {
        "name": "PartitionedCall/Where_1",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": { "dim": [{}, { "size": "1" }] } } },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/Cast_37",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": { "dim": [{ "size": "1" }] } } }
        }
      },
      {
        "name": "PartitionedCall/GatherV2_1",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": { "dim": [{}] } } },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/zeros_17",
        "op": "Const",
        "attr": { "dtype": { "type": "DT_INT64" }, "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": {} } } }
      },
      {
        "name": "PartitionedCall/Const_91",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": { "dim": [{ "size": "4" }, { "size": "2" }] } } }
        }
      },
      {
        "name": "PartitionedCall/transpose_242/perm",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": { "dim": [{ "size": "4" }] } } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/split_77",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "3" }, { "size": "3" }, { "size": "576" }, { "size": "64" }] }
            }
          }
        }
      },
      {
        "name": "unknown_164",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": { "dim": [{ "size": "64" }] } } }
        }
      },
      {
        "name": "PartitionedCall/transpose_243/perm",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": { "dim": [{ "size": "4" }] } } }
        }
      },
      {
        "name": "PartitionedCall/Const_93",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": { "dim": [{ "size": "4" }, { "size": "2" }] } } }
        }
      },
      {
        "name": "PartitionedCall/transpose_248/perm",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": { "dim": [{ "size": "4" }] } } }
        }
      },
      {
        "name": "PartitionedCall/split_79",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "3" }, { "size": "3" }, { "size": "64" }, { "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "unknown_168",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": { "dim": [{ "size": "64" }] } } },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "PartitionedCall/transpose_249/perm",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": { "dim": [{ "size": "4" }] } } }
        }
      },
      {
        "name": "PartitionedCall/transpose_254/perm",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": { "dim": [{ "size": "4" }] } } }
        }
      },
      {
        "name": "PartitionedCall/split_81",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "1" }, { "size": "1" }, { "size": "64" }, { "size": "64" }] }
            }
          }
        }
      },
      {
        "name": "unknown_172",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": { "dim": [{ "size": "64" }] } } }
        }
      },
      {
        "name": "PartitionedCall/transpose_255/perm",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": { "dim": [{ "size": "4" }] } } }
        }
      },
      {
        "name": "PartitionedCall/SelectV2_57",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": { "dim": [{ "size": "1" }] } } }
        }
      },
      {
        "name": "PartitionedCall/zeros_15",
        "op": "Const",
        "attr": { "dtype": { "type": "DT_INT64" }, "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": {} } } }
      },
      {
        "name": "PartitionedCall/Const_83",
        "op": "Const",
        "attr": { "dtype": { "type": "DT_INT64" }, "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": {} } } }
      },
      {
        "name": "PartitionedCall/Shape_16",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": { "dim": [{ "size": "4" }] } } },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/ExpandDims_14",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": { "dim": [{ "size": "1" }, { "size": "1" }] } } },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/Cast_34",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": { "dim": [{ "size": "1" }] } } },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/SelectV2_58",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": { "dim": [{ "size": "1" }] } } }
        }
      },
      {
        "name": "PartitionedCall/Const_82",
        "op": "Const",
        "attr": { "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": {} } }, "dtype": { "type": "DT_INT64" } }
      },
      {
        "name": "PartitionedCall/ones_14",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": { "dim": [{ "size": "4" }] } } }
        }
      },
      {
        "name": "PartitionedCall/SelectV2_49",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": { "dim": [{ "size": "1" }] } } },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/zeros_12",
        "op": "Const",
        "attr": { "dtype": { "type": "DT_INT64" }, "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": {} } } }
      },
      {
        "name": "PartitionedCall/Const_69",
        "op": "Const",
        "attr": { "dtype": { "type": "DT_INT64" }, "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": {} } } }
      },
      {
        "name": "PartitionedCall/Shape_12",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": { "dim": [{ "size": "4" }] } } }
        }
      },
      {
        "name": "PartitionedCall/ExpandDims_12",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": { "dim": [{ "size": "1" }, { "size": "1" }] } } }
        }
      },
      {
        "name": "PartitionedCall/Cast_29",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": { "dim": [{ "size": "1" }] } } },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/SelectV2_50",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": { "dim": [{ "size": "1" }] } } }
        }
      },
      {
        "name": "PartitionedCall/Const_68",
        "op": "Const",
        "attr": { "dtype": { "type": "DT_INT64" }, "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": {} } } }
      },
      {
        "name": "PartitionedCall/ones_12",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": { "dim": [{ "size": "4" }] } } },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/SelectV2_41",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": { "dim": [{ "size": "1" }] } } }
        }
      },
      {
        "name": "PartitionedCall/zeros_10",
        "op": "Const",
        "attr": { "dtype": { "type": "DT_INT64" }, "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": {} } } }
      },
      {
        "name": "PartitionedCall/Const_56",
        "op": "Const",
        "attr": { "dtype": { "type": "DT_INT64" }, "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": {} } } }
      },
      {
        "name": "PartitionedCall/Shape_10",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": { "dim": [{ "size": "4" }] } } },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/ExpandDims_10",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": { "dim": [{ "size": "1" }, { "size": "1" }] } } },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/Cast_25",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": { "dim": [{ "size": "1" }] } } }
        }
      },
      {
        "name": "PartitionedCall/SelectV2_42",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": { "dim": [{ "size": "1" }] } } },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/Const_55",
        "op": "Const",
        "attr": { "dtype": { "type": "DT_INT64" }, "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": {} } } }
      },
      {
        "name": "PartitionedCall/ones_10",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": { "dim": [{ "size": "4" }] } } },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/transpose_143/perm",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": { "dim": [{ "size": "4" }] } } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/Cast_23",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": { "dim": [{ "size": "2" }] } } }
        }
      },
      {
        "name": "PartitionedCall/transpose_144/perm",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": { "dim": [{ "size": "4" }] } } }
        }
      },
      {
        "name": "PartitionedCall/onnx_tf_prefix_/model.14/Concat/axis",
        "op": "Const",
        "attr": { "dtype": { "type": "DT_INT32" }, "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } } }
      },
      {
        "name": "PartitionedCall/transpose_146/perm",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": { "dim": [{ "size": "4" }] } } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/split_45",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "1" }, { "size": "1" }, { "size": "576" }, { "size": "192" }] }
            }
          }
        }
      },
      {
        "name": "unknown_99",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": { "dim": [{ "size": "192" }] } } },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "PartitionedCall/transpose_147/perm",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": { "dim": [{ "size": "4" }] } } }
        }
      },
      {
        "name": "PartitionedCall/SelectV2_45",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": { "dim": [{ "size": "1" }] } } }
        }
      },
      {
        "name": "PartitionedCall/zeros_11",
        "op": "Const",
        "attr": { "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": {} } }, "dtype": { "type": "DT_INT64" } }
      },
      {
        "name": "PartitionedCall/Const_58",
        "op": "Const",
        "attr": { "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": {} } }, "dtype": { "type": "DT_INT64" } }
      },
      {
        "name": "PartitionedCall/Shape_11",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": { "dim": [{ "size": "4" }] } } },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/ExpandDims_11",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": { "dim": [{ "size": "1" }, { "size": "1" }] } } }
        }
      },
      {
        "name": "PartitionedCall/Cast_27",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": { "dim": [{ "size": "1" }] } } },
          "dtype": { "type": "DT_INT64" }
        }
      },
      {
        "name": "PartitionedCall/SelectV2_46",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": { "dim": [{ "size": "1" }] } } }
        }
      },
      {
        "name": "PartitionedCall/Const_57",
        "op": "Const",
        "attr": { "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": {} } }, "dtype": { "type": "DT_INT64" } }
      },
      {
        "name": "PartitionedCall/ones_11",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT64" },
          "value": { "tensor": { "dtype": "DT_INT64", "tensorShape": { "dim": [{ "size": "4" }] } } }
        }
      },
      {
        "name": "PartitionedCall/Const_59",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": { "dim": [{ "size": "4" }, { "size": "2" }] } } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/transpose_149/perm",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": { "dim": [{ "size": "4" }] } } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/split_46",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "3" }, { "size": "3" }, { "size": "96" }, { "size": "96" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "unknown_101",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": { "dim": [{ "size": "96" }] } } }
        }
      },
      {
        "name": "PartitionedCall/transpose_150/perm",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": { "dim": [{ "size": "4" }] } } }
        }
      },
      {
        "name": "PartitionedCall/Const_60",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": { "dim": [{ "size": "4" }, { "size": "2" }] } } }
        }
      },
      {
        "name": "PartitionedCall/transpose_152/perm",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": { "dim": [{ "size": "4" }] } } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/split_47",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "3" }, { "size": "3" }, { "size": "96" }, { "size": "96" }] }
            }
          }
        }
      },
      {
        "name": "unknown_103",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": { "dim": [{ "size": "96" }] } } }
        }
      },
      {
        "name": "PartitionedCall/transpose_153/perm",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": { "dim": [{ "size": "4" }] } } }
        }
      },
      {
        "name": "PartitionedCall/Const_61",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": { "dim": [{ "size": "4" }, { "size": "2" }] } } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/transpose_155/perm",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": { "dim": [{ "size": "4" }] } } }
        }
      },
      {
        "name": "PartitionedCall/split_48",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "3" }, { "size": "3" }, { "size": "96" }, { "size": "96" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "unknown_105",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": { "dim": [{ "size": "96" }] } } },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "PartitionedCall/transpose_156/perm",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": { "dim": [{ "size": "4" }] } } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "PartitionedCall/Const_62",
        "op": "Const",
        "attr": {
